balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ06GS101A.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="FCLCON4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="FCLCON4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLTMOD" edc:desc="" edc:mask="0x3" edc:name="FLTMOD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FLTPOL" edc:desc="" edc:mask="0x1" edc:name="FLTPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC" edc:desc="" edc:mask="0x1f" edc:name="FLTSRC" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="CLMOD" edc:desc="" edc:mask="0x1" edc:name="CLMOD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLPOL" edc:desc="" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLSRC" edc:desc="" edc:mask="0x1f" edc:name="CLSRC" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="IFLTMOD" edc:desc="" edc:mask="0x1" edc:name="IFLTMOD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLTMOD0" edc:desc="" edc:mask="0x1" edc:name="FLTMOD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTMOD1" edc:desc="" edc:mask="0x1" edc:name="FLTMOD1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC0" edc:desc="" edc:mask="0x1" edc:name="FLTSRC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC1" edc:desc="" edc:mask="0x1" edc:name="FLTSRC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC2" edc:desc="" edc:mask="0x1" edc:name="FLTSRC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC3" edc:desc="" edc:mask="0x1" edc:name="FLTSRC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC4" edc:desc="" edc:mask="0x1" edc:name="FLTSRC4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CLSRC0" edc:desc="" edc:mask="0x1" edc:name="CLSRC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLSRC1" edc:desc="" edc:mask="0x1" edc:name="CLSRC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLSRC2" edc:desc="" edc:mask="0x1" edc:name="CLSRC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLSRC3" edc:desc="" edc:mask="0x1" edc:name="CLSRC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLSRC4" edc:desc="" edc:mask="0x1" edc:name="CLSRC4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PDC4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PDC4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PDC4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PHASE4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PHASE4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHASE4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PHASE4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="DTR4" edc:desc="" edc:impl="0x3ffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00000000000000" edc:name="DTR4" edc:nzwidth="0x10" edc:por="--00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTR4" edc:desc="" edc:islanghidden="true" edc:mask="0x3fff" edc:name="DTR4" edc:nzwidth="0xe"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="ALTDTR4" edc:desc="" edc:impl="0x3ffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00000000000000" edc:name="ALTDTR4" edc:nzwidth="0x10" edc:por="--00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ALTDTR4" edc:desc="" edc:islanghidden="true" edc:mask="0x3fff" edc:name="ALTDTR4" edc:nzwidth="0xe"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SDC4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SDC4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDC4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="SDC4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SPHASE4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SPHASE4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPHASE4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="SPHASE4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="TRIG4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000---" edc:name="TRIG4" edc:nzwidth="0x10" edc:por="0000000000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGCMP" edc:desc="" edc:mask="0x1fff" edc:name="TRGCMP" edc:nzwidth="13"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGCMP0" edc:desc="" edc:mask="0x1" edc:name="TRGCMP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP1" edc:desc="" edc:mask="0x1" edc:name="TRGCMP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP2" edc:desc="" edc:mask="0x1" edc:name="TRGCMP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP3" edc:desc="" edc:mask="0x1" edc:name="TRGCMP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP4" edc:desc="" edc:mask="0x1" edc:name="TRGCMP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP5" edc:desc="" edc:mask="0x1" edc:name="TRGCMP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP6" edc:desc="" edc:mask="0x1" edc:name="TRGCMP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP7" edc:desc="" edc:mask="0x1" edc:name="TRGCMP7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP8" edc:desc="" edc:mask="0x1" edc:name="TRGCMP8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP9" edc:desc="" edc:mask="0x1" edc:name="TRGCMP9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP10" edc:desc="" edc:mask="0x1" edc:name="TRGCMP10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP11" edc:desc="" edc:mask="0x1" edc:name="TRGCMP11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP12" edc:desc="" edc:mask="0x1" edc:name="TRGCMP12" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----n-nnnnnn" edc:cname="TRGCON4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----0-000000" edc:name="TRGCON4" edc:nzwidth="0x10" edc:por="0000----0-000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSTRT" edc:desc="" edc:mask="0x3f" edc:name="TRGSTRT" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DTM" edc:desc="" edc:mask="0x1" edc:name="DTM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRGDIV" edc:desc="" edc:mask="0xf" edc:name="TRGDIV" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSTRT0" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT1" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT2" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT3" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT4" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT5" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRGDIV0" edc:desc="" edc:mask="0x1" edc:name="TRGDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGDIV1" edc:desc="" edc:mask="0x1" edc:name="TRGDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGDIV2" edc:desc="" edc:mask="0x1" edc:name="TRGDIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGDIV3" edc:desc="" edc:mask="0x1" edc:name="TRGDIV3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="STRIG4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000---" edc:name="STRIG4" edc:nzwidth="0x10" edc:por="0000000000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="STRGCMP" edc:desc="" edc:islanghidden="true" edc:mask="0x1fff" edc:name="STRGCMP" edc:nzwidth="0xd"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="STRGCMP0" edc:desc="" edc:mask="0x1" edc:name="STRGCMP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP1" edc:desc="" edc:mask="0x1" edc:name="STRGCMP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP2" edc:desc="" edc:mask="0x1" edc:name="STRGCMP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP3" edc:desc="" edc:mask="0x1" edc:name="STRGCMP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP4" edc:desc="" edc:mask="0x1" edc:name="STRGCMP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP5" edc:desc="" edc:mask="0x1" edc:name="STRGCMP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP6" edc:desc="" edc:mask="0x1" edc:name="STRGCMP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP7" edc:desc="" edc:mask="0x1" edc:name="STRGCMP7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP8" edc:desc="" edc:mask="0x1" edc:name="STRGCMP8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP9" edc:desc="" edc:mask="0x1" edc:name="STRGCMP9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP10" edc:desc="" edc:mask="0x1" edc:name="STRGCMP10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP11" edc:desc="" edc:mask="0x1" edc:name="STRGCMP11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP12" edc:desc="" edc:mask="0x1" edc:name="STRGCMP12" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
